Repository: sandermvanvliet/ProtobufDecoder
Catalog: src/ProtobufDecoder.Application.Wpf/Strings.*.resx
Languages: nl_nl, zh_hans

# AboutAcknowledgements
source: Acknowledgements:
zh_hans: 致谢:

# AboutButtonClose
source: _Close
nl_nl: _Sluiten
zh_hans: 关闭

# AboutLicense
source: License:
zh_hans: 许可:

# AboutSources
source: Sources:
zh_hans: 项目:

# AboutTitle
source: About Protobuf Decoder
nl_nl: Over Protobuf Decoder
zh_hans: 关于 Protobuf Decoder

# AboutVersion
source: Version:
nl_nl: Versie:
zh_hans: 版本:

# CannotDecodeTag
source: Cannot decode selected tag
nl_nl: Tag kan niet gedecodeerd worden
zh_hans: 无法解码所选节点

# ClipboardEmpty
source: Clipboard did not contain any bytes to load
nl_nl: Het klembord bevatte geen data om te laden
zh_hans: 剪贴板不包含任何要加载的字节

# CommonTagProperties
source: Common
nl_nl: Algemeen
zh_hans: 属性

# ContextMenuCopyValue
source: Copy value as C# bytes
nl_nl: Kopieer tag waarde als C# bytes
zh_hans: 复制内容(C# bytes)

# ContextMenuDecodeAllTags
source: Decode all tags
nl_nl: Decodeer alle tags
zh_hans: 解码所有节点

# ContextMenuDecodeTag
source: _Decode tag
nl_nl: Tag _decoderen
zh_hans: 解码节点

# FailedToDecodeTag
source: Decoding tag failed: {0}
nl_nl: Tag kon niet gedecodeerd worden: {0}
zh_hans: 节点解码失败: {0}

# FileFailedToLoad
source: File failed to load: {0}
nl_nl: Bestand kon niet geladen worden: {0}
zh_hans: 文件加载失败: {0}

# FileLengthPrefix
source: File has a {0}-byte length prefix which was stripped
nl_nl: Bestand heeft een lengte prefix van {0}-bytes, deze is overgeslagen
zh_hans: 已删除文件中包含的{0}字节前缀

source: File loaded successfully
nl_nl: Bestand succesvol geladen
zh_hans: 文件加载成功

# FileLoadedWithWarnings
source: File loaded successfully: {0}
nl_nl: Bestand succesvol geladen: {0}
zh_hans: 文件加载成功: {0}

# InputCaption
source: Parameters
zh_hans: 参数

# InputFileDoesNotExist_Text
source: Please check the path to the input file
nl_nl: Controleer het pad naar het bronbestand
zh_hans: 请检查目标文件的路径

# InputIsEmpty
source: Input is either empty or contains only newlines, spaces etc
nl_nl: Invoer is blanco of bevat alleen regeleinden, spaties etc
zh_hans: 输入为空或仅包含换行符/空格等

# InputIsNotBase64
source: Input appears not to be valid base-64 : {0}
nl_nl: Invoer lijkt geen geldige base-64 te zijn: {0}
zh_hans: 输入内容不符合Base64标准 : {0}

# InputSourcePath
source: Input file:
nl_nl: Bronbestand:
zh_hans: 目标文件:

# LoadBase64Instruction
source: Base64 input with and without padding is supported. Newlines, spaces and double quotes are automatically removed.
nl_nl: Base64 invoer met en zonder padding wordt ondersteund. Regeleinden, spaties en aanhalingstekens worden automatisch verwijderd.
zh_hans: 支持Padding/NoPadding的Base64格式 换行符/空格/双引号将自动删除

# LoadBase64StringTitle
source: Load Base64 string
nl_nl: Laad Base64 string
zh_hans: 加载Base64文本

# LoadButton
source: _Load
nl_nl: _Laden
zh_hans: 加载

# LoadHexStreamInstruction
source: Supported formats: - 0x00 0x01 - 0x0001 - \x00\x01 - 00 01 Newlines, spaces and double quotes are automatically removed.
nl_nl: Voer hex stream in geformatteerd zonder 0x voorvoegsel
zh_hans: 支持格式: - 0x00 0x01 - 0x0001 - \x00\x01 - 00 01 换行符/空格/双引号将自动删除

# LoadHexStringTitle
source: Load hex stream
nl_nl: Laad hex stream
zh_hans: 加载十六进制文本

# MenuFile
source: _File
nl_nl: _Bestand
zh_hans: 文件

# MenuFileExit
source: E_xit
nl_nl: _Afsluiten
zh_hans: 退出

# MenuFileNewWindow
source: _New window
nl_nl: _Nieuw venster
zh_hans: 新窗口

# MenuFileOpen
source: _Open
nl_nl: _Openen
zh_hans: 打开

# MenuFileSaveGeneratedProto
source: _Save proto file
nl_nl: Proto bestand _opslaan
zh_hans: 保存文件(proto)

# MenuFileSaveGeneratedProtoAs
source: Save proto file _As...
nl_nl: Proto bestand opslaan _als...
zh_hans: 文件另存为(proto)

# MenuHelp
source: _Help
zh_hans: 帮助

# MenuHelpAbout
source: _About
nl_nl: _Over
zh_hans: 关于

# MenuLoadFromBase64String
source: Load from Base64 string
nl_nl: Laad Base64 string
zh_hans: 加载Base64文本

# MenuLoadFromClipboard
source: Load from clipboard
nl_nl: Laden vanaf klembord
zh_hans: 加载剪贴板内容

# MenuLoadFromHexStream
source: Load from hex stream
nl_nl: Laad vanuit hex stream
zh_hans: 加载十六进制文本

# ProtoFileFailedToSave
source: Failed to save proto file: {0}
nl_nl: Proto bestand kon niet worden opgeslagen: {0}
zh_hans: 保存文件失败: {0}

# ProtoFileSavedAs
source: Proto file saved as: {0}
nl_nl: Proto bestand opgeslagen als: {0}
zh_hans: 文件另存为: {0}

# ProtoFileSavedSuccessfully
source: Proto file saved
nl_nl: Proto bestand opgeslagen
zh_hans: 文件已保存

# StatusBarReadyText
source: Ready
nl_nl: Opgestart
zh_hans: 就绪

# TagCopiedToClipboard
source: Tag value copied to clipboard
nl_nl: Tag waarde naar klembord gekopieerd
zh_hans: 节点内容已复制

source: Tag decoded successfully
nl_nl: Tag gedecodeerd
zh_hans: 节点解码成功

# TagPropertiesName
source: Name
nl_nl: Naam
zh_hans: 名称

# TagPropertiesValue
source: Value
nl_nl: Waarde
zh_hans: 内容

# TagRepeated
source: (repeated)
nl_nl: (herhaald)

# ProtoFileType
source: Protobuf files (.proto)|*.proto
nl_nl: Protobuf bestand (.proto)|*.proto
